
#################################
## domain dossier
#################################
[dossier_dest]
display_location = field_menu
fields = *dest
label = Domain Dossier
link.method = get
link.target = blank
link.uri = http://centralops.net/co/DomainDossier.aspx?addr=$@field_value$&dom_whois=true&dom_dns=true&net_whois=true
type = link

[dossier_dest_dns]
display_location = field_menu
fields = *dest_dns
label = Domain Dossier
link.method = get
link.target = blank
link.uri = http://centralops.net/co/DomainDossier.aspx?addr=$@field_value$&dom_whois=true&dom_dns=true&net_whois=true
type = link

[dossier_dest_ip]
display_location = field_menu
fields = *dest_ip
label = Domain Dossier
link.method = get
link.target = blank
link.uri = http://centralops.net/co/DomainDossier.aspx?addr=$@field_value$&dom_whois=true&dom_dns=true&net_whois=true
type = link

[dossier_dvc]
display_location = field_menu
fields = *dvc
label = Domain Dossier
link.method = get
link.target = blank
link.uri = http://centralops.net/co/DomainDossier.aspx?addr=$@field_value$&dom_whois=true&dom_dns=true&net_whois=true
type = link

[dossier_dvc_dns]
display_location = field_menu
fields = *dvc_dns
label = Domain Dossier
link.method = get
link.target = blank
link.uri = http://centralops.net/co/DomainDossier.aspx?addr=$@field_value$&dom_whois=true&dom_dns=true&net_whois=true
type = link

[dossier_dvc_ip]
display_location = field_menu
fields = *dvc_ip
label = Domain Dossier
link.method = get
link.target = blank
link.uri = http://centralops.net/co/DomainDossier.aspx?addr=$@field_value$&dom_whois=true&dom_dns=true&net_whois=true
type = link

[dossier_host]
display_location = field_menu
fields = host
label = Domain Dossier
link.method = get
link.target = blank
link.uri = http://centralops.net/co/DomainDossier.aspx?addr=$@field_value$&dom_whois=true&dom_dns=true&net_whois=true
type = link

[dossier_host_dns]
display_location = field_menu
fields = *host_dns
label = Domain Dossier
link.method = get
link.target = blank
link.uri = http://centralops.net/co/DomainDossier.aspx?addr=$@field_value$&dom_whois=true&dom_dns=true&net_whois=true
type = link

[dossier_host_ip]
display_location = field_menu
fields = *host_ip
label = Domain Dossier
link.method = get
link.target = blank
link.uri = http://centralops.net/co/DomainDossier.aspx?addr=$@field_value$&dom_whois=true&dom_dns=true&net_whois=true
type = link

[dossier_src]
display_location = field_menu
fields = *src
label = Domain Dossier
link.method = get
link.target = blank
link.uri = http://centralops.net/co/DomainDossier.aspx?addr=$@field_value$&dom_whois=true&dom_dns=true&net_whois=true
type = link

[dossier_src_dns]
display_location = field_menu
fields = *src_dns
label = Domain Dossier
link.method = get
link.target = blank
link.uri = http://centralops.net/co/DomainDossier.aspx?addr=$@field_value$&dom_whois=true&dom_dns=true&net_whois=true
type = link

[dossier_src_ip]
display_location = field_menu
fields = *src_ip
label = Domain Dossier
link.method = get
link.target = blank
link.uri = http://centralops.net/co/DomainDossier.aspx?addr=$@field_value$&dom_whois=true&dom_dns=true&net_whois=true
type = link


#################################
## EventId
#################################
[search4original]
display_location = event_menu
fields = orig_splunk_server,orig_index,orig_cd
label = Search for original event
link.method = get
link.uri = /app/$@namespace$/search?q=search splunk_server=$orig_splunk_server$ index=$orig_index$ | search _cd=$orig_cd$ | head 1
type = link


#################################
## google
#################################
[Google]
display_location = field_menu
fields = *
label = Google $@field_value$
link.method = get
link.uri = http://www.google.com/search?q=$@field_value$
type = link

[gmaps_dest]
display_location = field_menu
fields = *dest,*dest_lat,*dest_long
label = Map $@field_value$
link.method = get
link.target = blank
link.uri = http://maps.google.com/maps?q=$dest_lat$,$dest_long$
type = link

[gmaps_dvc]
display_location = field_menu
fields = *dvc,*dvc_lat,*dvc_long
label = Map $@field_value$
link.method = get
link.target = blank
link.uri = http://maps.google.com/maps?q=$dvc_lat$,$dvc_long$
type = link

[gmaps_host]
display_location = field_menu
fields = host,*host_lat,*host_long
label = Map $@field_value$
link.method = get
link.target = blank
link.uri = http://maps.google.com/maps?q=$host_lat$,$host_long$
type = link

[gmaps_orig_host]
display_location = field_menu
fields = *orig_host,*orig_host_lat,*orig_host_long
label = Map $@field_value$
link.method = get
link.target = blank
link.uri = http://maps.google.com/maps?q=$orig_host_lat$,$orig_host_long$
type = link

[gmaps_src]
display_location = field_menu
fields = *src,*src_lat,*src_long
label = Map $@field_value$
link.method = get
link.target = blank
link.uri = http://maps.google.com/maps?q=$src_lat$,$src_long$
type = link


#################################
## incident review
#################################

## Notable Event Share
[incident_review_share_link]
display_location = event_menu
eventtypes       = notable
label            = Share Notable Event
link.method      = get
link.target      = self
link.uri         = #share_ne_link
type             = link

## Notable Event Suppress
[incident_review_suppress_link]
display_location = event_menu
eventtypes       = notable
label            = Suppress Notable Events
link.method      = get
link.target      = self
link.uri         = #suppress_ne_link
type             = link

## Notable Event Create
[create_notable_from_raw]
display_location = event_menu
eventtypes       = *
fields           = *
label            = Create notable event
link.method      = get
link.target      = blank
link.uri         = /app/$@namespace$/ess_notable_event_create?splunk_server=$splunk_server$&index=$index$&_cd=$_cd$&_time=$_time$&_raw=$_raw$
type             = link

## All modular alert actions
[incident_review_all_actions]
display_location = event_menu
eventtypes       = notable
label            = Run Adaptive Response Actions
link.method      = get
link.target      = self
link.uri         = #show_modular_alert_actions
type             = link

## Notable Event Search
[incident_review_src_as_src]
display_location = field_menu
fields = *src
label = Notable Event Search
type = link
link.uri = /app/$@namespace$/incident_review?form.srch=src%3d%22$@field_value$%22

[incident_review_dest_as_dest]
display_location = field_menu
fields = *dest
label = Notable Event Search
type = link
link.uri = /app/$@namespace$/incident_review?form.srch=dest%3d%22$@field_value$%22

[incident_review_user_as_user]
display_location = field_menu
fields = *user
label = Notable Event Search
type = link
link.uri = /app/$@namespace$/incident_review?form.srch=user%3d%22$@field_value$%22

[incident_review_file_name_as_file_name]
display_location = field_menu
fields = *file_name
label = Notable Event Search
type = link
link.uri = /app/$@namespace$/incident_review?form.srch=file_name%3d%22$@field_value$%22

[incident_review_dvc_as_dvc]
display_location = field_menu
fields = *dvc
label = Notable Event Search
type = link
link.uri = /app/$@namespace$/incident_review?form.srch=dvc%3d%22$@field_value$%22

[incident_review_src_port_as_src_port]
display_location = field_menu
fields = *src_port
label = Notable Event Search
type = link
link.uri = /app/$@namespace$/incident_review?form.srch=src_port%3d%22$@field_value$%22

[incident_review_dest_port_as_dest_port]
display_location = field_menu
fields = *dest_port
label = Notable Event Search
type = link
link.uri = /app/$@namespace$/incident_review?form.srch=dest_port%3d%22$@field_value$%22

[incident_review_http_user_agent_as_http_user_agent]
display_location = field_menu
fields = *http_user_agent
label = Notable Event Search
type = link
link.uri = /app/$@namespace$/incident_review?form.srch=http_user_agent%3d%22$@field_value$%22

[incident_review_url_as_url]
display_location = field_menu
fields = *url
label = Notable Event Search
type = link
link.uri = /app/$@namespace$/incident_review?form.srch=url%3d%22$@field_value$%22

[incident_review_app_as_app]
display_location = field_menu
fields = *app
label = Notable Event Search
type = link
link.uri = /app/$@namespace$/incident_review?form.srch=app%3d%22$@field_value$%22

[incident_review_dest_nt_domain_as_dest_nt_domain]
display_location = field_menu
fields = *dest_nt_domain
label = Notable Event Search
type = link
link.uri = /app/$@namespace$/incident_review?form.srch=dest_nt_domain%3d%22$@field_value$%22

[incident_review_signature_as_signature]
display_location = field_menu
fields = *signature
label = Notable Event Search
type = link
link.uri = /app/$@namespace$/incident_review?form.srch=signature%3d%22$@field_value$%22

[incident_review_file_path_as_file_path]
display_location = field_menu
fields = *file_path
label = Notable Event Search
type = link
link.uri = /app/$@namespace$/incident_review?form.srch=file_path%3d%22$@field_value$%22

[incident_review_file_hash_as_file_hash]
display_location = field_menu
fields = *file_hash
label = Notable Event Search
type = link
link.uri = /app/$@namespace$/incident_review?form.srch=file_hash%3d%22$@field_value$%22

[incident_review_http_referrer_as_http_referrer]
display_location = field_menu
fields = *http_referrer
label = Notable Event Search
type = link
link.uri = /app/$@namespace$/incident_review?form.srch=http_referrer%3d%22$@field_value$%22

[incident_review_http_content_type_as_http_content_type]
display_location = field_menu
fields = *http_content_type
label = Notable Event Search
type = link
link.uri = /app/$@namespace$/incident_review?form.srch=http_content_type%3d%22$@field_value$%22

[incident_review_dest_ip_as_dest_ip]
display_location = field_menu
fields = *dest_ip
label = Notable Event Search
type = link
link.uri = /app/$@namespace$/incident_review?form.srch=dest_ip%3d%22$@field_value$%22

[incident_review_src_ip_as_src_ip]
display_location = field_menu
fields = *src_ip
label = Notable Event Search
type = link
link.uri = /app/$@namespace$/incident_review?form.srch=src_ip%3d%22$@field_value$%22

[incident_review_dest_nt_host_as_dest_nt_host]
display_location = field_menu
fields = *dest_nt_host
label = Notable Event Search
type = link
link.uri = /app/$@namespace$/incident_review?form.srch=dest_nt_host%3d%22$@field_value$%22

[incident_review_src_nt_host_as_src_nt_host]
display_location = field_menu
fields = *src_nt_host
label = Notable Event Search
type = link
link.uri = /app/$@namespace$/incident_review?form.srch=src_nt_host%3d%22$@field_value$%22

[incident_review_src_dns_as_src_dns]
display_location = field_menu
fields = *src_dns
label = Notable Event Search
type = link
link.uri = /app/$@namespace$/incident_review?form.srch=src_dns%3d%22$@field_value$%22

[incident_review_dest_dns_as_dest_dns]
display_location = field_menu
fields = *dest_dns
label = Notable Event Search
type = link
link.uri = /app/$@namespace$/incident_review?form.srch=dest_dns%3d%22$@field_value$%22


#################################
## nbtstat
#################################
[nbtstat_dest]
display_location = field_menu
fields = *dest
label = Nbtstat $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| nbtstat host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[nbtstat_dest_dns]
display_location = field_menu
fields = *dest_dns
label = Nbtstat $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| nbtstat host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[nbtstat_dest_ip]
display_location = field_menu
fields = *dest_ip
label = Nbtstat $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| nbtstat host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[nbtstat_dest_nt_host]
display_location = field_menu
fields = *dest_nt_host
label = Nbtstat $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| nbtstat host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[nbtstat_dvc]
display_location = field_menu
fields = *dvc
label = Nbtstat $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| nbtstat host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[nbtstat_dvc_dns]
display_location = field_menu
fields = *dvc_dns
label = Nbtstat $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| nbtstat host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[nbtstat_dvc_ip]
display_location = field_menu
fields = *dvc_ip
label = Nbtstat $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| nbtstat host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[nbtstat_dvc_nt_host]
display_location = field_menu
fields = *dvc_nt_host
label = Nbtstat $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| nbtstat host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[nbtstat_host]
display_location = field_menu
fields = host
label = Nbtstat $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| nbtstat host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[nbtstat_host_dns]
display_location = field_menu
fields = *host_dns
label = Nbtstat $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| nbtstat host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[nbtstat_host_ip]
display_location = field_menu
fields = *host_ip
label = Nbtstat $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| nbtstat host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[nbtstat_host_nt_host]
display_location = field_menu
fields = *host_nt_host
label = Nbtstat $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| nbtstat host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[nbtstat_src]
display_location = field_menu
fields = *src
label = Nbtstat $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| nbtstat host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[nbtstat_src_dns]
display_location = field_menu
fields = *src_dns
label = Nbtstat $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| nbtstat host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[nbtstat_src_ip]
display_location = field_menu
fields = *src_ip
label = Nbtstat $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| nbtstat host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[nbtstat_src_nt_host]
display_location = field_menu
fields = *src_nt_host
label = Nbtstat $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| nbtstat host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link


#################################
## nslookup
#################################
[nslookup_dest]
display_location = field_menu
fields = *dest
label = Nslookup $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| nslookup host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[nslookup_dest_dns]
display_location = field_menu
fields = *dest_dns
label = Nslookup $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| nslookup host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[nslookup_dest_ip]
display_location = field_menu
fields = *dest_ip
label = Nslookup $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| nslookup host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[nslookup_dest_nt_host]
display_location = field_menu
fields = *dest_nt_host
label = Nslookup $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| nslookup host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[nslookup_dvc]
display_location = field_menu
fields = *dvc
label = Nslookup $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| nslookup host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[nslookup_dvc_dns]
display_location = field_menu
fields = *dvc_dns
label = Nslookup $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| nslookup host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[nslookup_dvc_ip]
display_location = field_menu
fields = *dvc_ip
label = Nslookup $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| nslookup host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[nslookup_dvc_nt_host]
display_location = field_menu
fields = *dvc_nt_host
label = Nslookup $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| nslookup host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[nslookup_host]
display_location = field_menu
fields = host
label = Nslookup $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| nslookup host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[nslookup_host_dns]
display_location = field_menu
fields = *host_dns
label = Nslookup $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| nslookup host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[nslookup_host_ip]
display_location = field_menu
fields = *host_ip
label = Nslookup $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| nslookup host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[nslookup_host_nt_host]
display_location = field_menu
fields = *host_nt_host
label = Nslookup $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| nslookup host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[nslookup_src]
display_location = field_menu
fields = *src
label = Nslookup $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| nslookup host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[nslookup_src_dns]
display_location = field_menu
fields = *src_dns
label = Nslookup $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| nslookup host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[nslookup_src_ip]
display_location = field_menu
fields = *src_ip
label = Nslookup $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| nslookup host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[nslookup_src_nt_host]
display_location = field_menu
fields = *src_nt_host
label = Nslookup $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| nslookup host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link


#################################
## Ping
#################################
[ping_dest]
display_location = field_menu
fields = *dest
label = Ping $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| ping host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[ping_dest_dns]
display_location = field_menu
fields = *dest_dns
label = Ping $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| ping host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[ping_dest_ip]
display_location = field_menu
fields = *dest_ip
label = Ping $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| ping host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[ping_dest_nt_host]
display_location = field_menu
fields = *dest_nt_host
label = Ping $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| ping host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[ping_dvc]
display_location = field_menu
fields = *dvc
label = Ping $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| ping host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[ping_dvc_dns]
display_location = field_menu
fields = *dvc_dns
label = Ping $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| ping host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[ping_dvc_ip]
display_location = field_menu
fields = *dvc_ip
label = Ping $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| ping host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[ping_dvc_nt_host]
display_location = field_menu
fields = *dvc_nt_host
label = Ping $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| ping host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[ping_host]
display_location = field_menu
fields = host
label = Ping $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| ping host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[ping_host_dns]
display_location = field_menu
fields = *host_dns
label = Ping $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| ping host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[ping_host_ip]
display_location = field_menu
fields = *host_ip
label = Ping $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| ping host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[ping_host_nt_host]
display_location = field_menu
fields = *host_nt_host
label = Ping $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| ping host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[ping_src]
display_location = field_menu
fields = *src
label = Ping $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| ping host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[ping_src_dns]
display_location = field_menu
fields = *src_dns
label = Ping $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| ping host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[ping_src_ip]
display_location = field_menu
fields = *src_ip
label = Ping $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| ping host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link

[ping_src_nt_host]
display_location = field_menu
fields = *src_nt_host
label = Ping $@field_value$
link.method = get
link.uri = /app/$@namespace$/search?q=| ping host=$@field_value$ orig_sid=$orig_sid$ orig_rid=$orig_rid$
type = link
