[default]
LOOKUP-zu-asset_lookup_by_str-dest = asset_lookup_by_str key AS dest OUTPUTNEW asset_id AS dest_asset_id asset_tag AS dest_asset_tag bunit AS dest_bunit category AS dest_category city AS dest_city country AS dest_country dns AS dest_dns ip AS dest_ip is_expected AS dest_is_expected lat AS dest_lat long AS dest_long mac AS dest_mac nt_host AS dest_nt_host owner AS dest_owner pci_domain AS dest_pci_domain priority AS dest_priority requires_av AS dest_requires_av should_timesync AS dest_should_timesync should_update AS dest_should_update
LOOKUP-zv-asset_lookup_by_cidr-dest = asset_lookup_by_cidr key AS dest OUTPUTNEW asset_id AS dest_asset_id asset_tag AS dest_asset_tag bunit AS dest_bunit category AS dest_category city AS dest_city country AS dest_country dns AS dest_dns ip AS dest_ip is_expected AS dest_is_expected lat AS dest_lat long AS dest_long mac AS dest_mac nt_host AS dest_nt_host owner AS dest_owner pci_domain AS dest_pci_domain priority AS dest_priority requires_av AS dest_requires_av should_timesync AS dest_should_timesync should_update AS dest_should_update
LOOKUP-zz-asset_lookup_default_fields-dest = asset_lookup_default_fields key AS dest OUTPUTNEW is_expected AS dest_is_expected pci_domain AS dest_pci_domain requires_av AS dest_requires_av should_timesync AS dest_should_timesync should_update AS dest_should_update
LOOKUP-zu-asset_lookup_by_str-dvc = asset_lookup_by_str key AS dvc OUTPUTNEW asset_id AS dvc_asset_id asset_tag AS dvc_asset_tag bunit AS dvc_bunit category AS dvc_category city AS dvc_city country AS dvc_country dns AS dvc_dns ip AS dvc_ip is_expected AS dvc_is_expected lat AS dvc_lat long AS dvc_long mac AS dvc_mac nt_host AS dvc_nt_host owner AS dvc_owner pci_domain AS dvc_pci_domain priority AS dvc_priority requires_av AS dvc_requires_av should_timesync AS dvc_should_timesync should_update AS dvc_should_update
LOOKUP-zv-asset_lookup_by_cidr-dvc = asset_lookup_by_cidr key AS dvc OUTPUTNEW asset_id AS dvc_asset_id asset_tag AS dvc_asset_tag bunit AS dvc_bunit category AS dvc_category city AS dvc_city country AS dvc_country dns AS dvc_dns ip AS dvc_ip is_expected AS dvc_is_expected lat AS dvc_lat long AS dvc_long mac AS dvc_mac nt_host AS dvc_nt_host owner AS dvc_owner pci_domain AS dvc_pci_domain priority AS dvc_priority requires_av AS dvc_requires_av should_timesync AS dvc_should_timesync should_update AS dvc_should_update
LOOKUP-zz-asset_lookup_default_fields-dvc = asset_lookup_default_fields key AS dvc OUTPUTNEW is_expected AS dvc_is_expected pci_domain AS dvc_pci_domain requires_av AS dvc_requires_av should_timesync AS dvc_should_timesync should_update AS dvc_should_update
LOOKUP-zu-asset_lookup_by_str-src = asset_lookup_by_str key AS src OUTPUTNEW asset_id AS src_asset_id asset_tag AS src_asset_tag bunit AS src_bunit category AS src_category city AS src_city country AS src_country dns AS src_dns ip AS src_ip is_expected AS src_is_expected lat AS src_lat long AS src_long mac AS src_mac nt_host AS src_nt_host owner AS src_owner pci_domain AS src_pci_domain priority AS src_priority requires_av AS src_requires_av should_timesync AS src_should_timesync should_update AS src_should_update
LOOKUP-zv-asset_lookup_by_cidr-src = asset_lookup_by_cidr key AS src OUTPUTNEW asset_id AS src_asset_id asset_tag AS src_asset_tag bunit AS src_bunit category AS src_category city AS src_city country AS src_country dns AS src_dns ip AS src_ip is_expected AS src_is_expected lat AS src_lat long AS src_long mac AS src_mac nt_host AS src_nt_host owner AS src_owner pci_domain AS src_pci_domain priority AS src_priority requires_av AS src_requires_av should_timesync AS src_should_timesync should_update AS src_should_update
LOOKUP-zz-asset_lookup_default_fields-src = asset_lookup_default_fields key AS src OUTPUTNEW is_expected AS src_is_expected pci_domain AS src_pci_domain requires_av AS src_requires_av should_timesync AS src_should_timesync should_update AS src_should_update
LOOKUP-zy-identity_lookup_expanded-src_user = identity_lookup_expanded key AS src_user OUTPUTNEW bunit AS src_user_bunit category AS src_user_category email AS src_user_email endDate AS src_user_endDate first AS src_user_first identity AS src_user_identity identity_tag AS src_user_identity_tag last AS src_user_last managedBy AS src_user_managedBy nick AS src_user_nick phone AS src_user_phone phone2 AS src_user_phone2 prefix AS src_user_prefix priority AS src_user_priority startDate AS src_user_startDate suffix AS src_user_suffix watchlist AS src_user_watchlist work_city AS src_user_work_city work_country AS src_user_work_country work_lat AS src_user_work_lat work_long AS src_user_work_long
LOOKUP-zz-identity_lookup_default_fields-src_user = identity_lookup_default_fields key AS src_user OUTPUTNEW watchlist AS src_user_watchlist
LOOKUP-zy-identity_lookup_expanded-user = identity_lookup_expanded key AS user OUTPUTNEW bunit AS user_bunit category AS user_category email AS user_email endDate AS user_endDate first AS user_first identity AS user_identity identity_tag AS user_identity_tag last AS user_last managedBy AS user_managedBy nick AS user_nick phone AS user_phone phone2 AS user_phone2 prefix AS user_prefix priority AS user_priority startDate AS user_startDate suffix AS user_suffix watchlist AS user_watchlist work_city AS user_work_city work_country AS user_work_country work_lat AS user_work_lat work_long AS user_work_long
LOOKUP-zz-identity_lookup_default_fields-user = identity_lookup_default_fields key AS user OUTPUTNEW watchlist AS user_watchlist
