
###### Correlation Searches ######
[Audit - Anomalous Audit Trail Activity Detected - Rule]
action.email.sendresults            = 0
action.risk                         = 1
action.risk.param._risk_object      = dest
action.risk.param._risk_object_type = system
action.risk.param._risk_score       = 40
action.notable                      = 1
## action.summary_index._name present for migration purposes
action.summary_index._name          = notable
alert.digest_mode                   = 1
alert.suppress                      = 1
alert.suppress.fields               = dest,signature
alert.suppress.period               = 86300s
alert.track                         = false
cron_schedule                       = */5 * * * *
disabled                            = True
dispatch.earliest_time              = rt-5m@m
dispatch.latest_time                = rt+5m@m
dispatch.rt_backfill                = 1
enableSched                         = 1
is_visible                          = false
search                              = | datamodel "Change_Analysis" "Auditing_Changes" search | where ('All_Changes.action'="cleared" OR 'All_Changes.action'="stopped") | stats max(_time) as "lastTime",latest(_raw) as "orig_raw",count by "All_Changes.dest","All_Changes.result" | rename "All_Changes.dest" as "dest","All_Changes.result" as "signature"

[Audit - Expected Host Not Reporting - Rule]
action.email.sendresults            = 0
action.risk                         = 1
action.risk.param._risk_object      = host
action.risk.param._risk_object_type = system
action.risk.param._risk_score       = 60
action.notable                      = 1
## action.summary_index._name present for migration purposes
action.summary_index._name          = notable
alert.digest_mode                   = 1
alert.suppress                      = 1
alert.suppress.fields               = host
alert.suppress.period               = 86300s
alert.track                         = false
cron_schedule                       = 0,15,30,45 * * * *
disabled                            = True
dispatch.latest_time                = +0s
enableSched                         = 1
is_visible                          = false
search                              = | `host_eventcount(30,2)` | search is_expected=true | `ctime(lastTime)` | fields + host,lastTime,is_expected,dayDiff

[Audit - Personally Identifiable Information Detection - Rule]
action.email.sendresults            = 0
action.risk                         = 1
action.risk.param._risk_object      = host
action.risk.param._risk_object_type = system
action.risk.param._risk_score       = 80
action.notable                      = 1
## action.summary_index._name present for migration purposes
action.summary_index._name          = notable
alert.digest_mode                   = 1
alert.suppress                      = 1
alert.suppress.fields               = pii_hash
alert.suppress.period               = 86300s
alert.track                         = false
cron_schedule                       = */5 * * * *
disabled                            = True
dispatch.earliest_time              = rt-5m@m
dispatch.latest_time                = rt+5m@m
dispatch.rt_backfill                = 1
enableSched                         = 1
is_visible                          = false
search                              = NOT sourcetype=stash | `get_integer_seq` | lookup luhn_lite_lookup integer_seq OUTPUTNEW pii,pii_clean | eval pii_length=len(pii_clean) | lookup iin_lookup iin as pii_clean,length as pii_length OUTPUTNEW iin_issuer | search iin_issuer=* | `get_event_id` | fields + event_id,_raw,host,pii,iin_issuer | eval pii_hash=sha1(pii)

[Audit - Potential Gap in Data - Rule]
action.email.sendresults   = 0
action.notable             = 1
## action.summary_index._name present for migration purposes
action.summary_index._name = notable
alert.digest_mode          = 1
alert.suppress             = 1
alert.suppress.fields      = const_dedup_id
alert.suppress.period      = 14400s
alert.track                = 0
cron_schedule              = */2 * * * *
disabled                   = True
dispatch.earliest_time     = -10m
dispatch.latest_time       = -5m
enableSched                = 1
is_visible                 = false
search                     = | datamodel "Splunk_Audit" "Scheduler_Activity" search | where 'Scheduler_Activity.status'="success" AND ('Scheduler_Activity.app' LIKE "Splunk_%" OR 'Scheduler_Activity.app' LIKE "SA-%" OR 'Scheduler_Activity.app' LIKE "DA-%" OR 'Scheduler_Activity.app'="SplunkEnterpriseSecuritySuite" OR 'Scheduler_Activity.app'="SplunkPCIComplianceSuite") | stats count | where 'count'=0 | eval const_dedup_id="const_dedup_id"


###### Key Indicator Searches ######
[Licensing - Minimum Events Per Day]
action.email.reportServerEnabled              = 0
alert.track                                   = 0
action.keyindicator                           = 1
action.keyindicator.title                     = Minimum EPD
action.keyindicator.subtitle                  = Count
action.keyindicator.value                     = min_count
action.keyindicator.threshold                 = 
action.keyindicator.delta                     = 
action.keyindicator.invert                    = false
action.keyindicator.group.0.name              = index_auditing
action.keyindicator.group.0.order             = 0
dispatch.latest_time                          = now
display.general.enablePreview                 = 1
display.general.timeRangePicker.show          = false
display.general.type                          = visualizations
display.statistics.rowNumbers                 = 0
display.statistics.wrap                       = 0
display.visualizations.charting.drilldown     = all
display.visualizations.singlevalue.underLabel = Minimum EPD
display.visualizations.show                   = 1
display.visualizations.type                   = singlevalue
search                                        = | `licensing_epd` | stats sum(count) as count by _time | stats min(count) as min_count

[Licensing - Average Events Per Day]
action.email.reportServerEnabled              = 0
alert.track                                   = 0
action.keyindicator                           = 1
action.keyindicator.title                     = Average EPD
action.keyindicator.subtitle                  = Count
action.keyindicator.value                     = avg_count
action.keyindicator.threshold                 = 
action.keyindicator.delta                     = 
action.keyindicator.invert                    = false
action.keyindicator.group.0.name              = index_auditing
action.keyindicator.group.0.order             = 1
dispatch.latest_time                          = now
display.general.enablePreview                 = 1
display.general.timeRangePicker.show          = false
display.general.type                          = visualizations
display.statistics.rowNumbers                 = 0
display.statistics.wrap                       = 0
display.visualizations.charting.drilldown     = all
display.visualizations.singlevalue.underLabel = Average EPD
display.visualizations.show                   = 1
display.visualizations.type                   = singlevalue
search                                        = | `licensing_epd` | stats sum(count) as count by _time | stats avg(count) as avg_count

[Licensing - Maximum Events Per Day]
action.email.reportServerEnabled              = 0
alert.track                                   = 0
action.keyindicator                           = 1
action.keyindicator.title                     = Maximum EPD
action.keyindicator.subtitle                  = Count
action.keyindicator.value                     = max_count
action.keyindicator.threshold                 = 
action.keyindicator.delta                     = 
action.keyindicator.invert                    = false
action.keyindicator.group.0.name              = index_auditing
action.keyindicator.group.0.order             = 2
dispatch.latest_time                          = now
display.general.enablePreview                 = 1
display.general.timeRangePicker.show          = false
display.general.type                          = visualizations
display.statistics.rowNumbers                 = 0
display.statistics.wrap                       = 0
display.visualizations.charting.drilldown     = all
display.visualizations.singlevalue.underLabel = Maximum EPD
display.visualizations.show                   = 1
display.visualizations.type                   = singlevalue
search                                        = | `licensing_epd` | stats sum(count) as count by _time | stats max(count) as max_count

[Licensing - Recent Events Per Day]
action.email.reportServerEnabled              = 0
alert.track                                   = 0
action.keyindicator                           = 1
action.keyindicator.title                     = Recent EPD
action.keyindicator.subtitle                  = Count
action.keyindicator.value                     = current_count
action.keyindicator.threshold                 = 
action.keyindicator.delta                     = delta
action.keyindicator.invert                    = false
action.keyindicator.group.0.name              = index_auditing
action.keyindicator.group.0.order             = 3
dispatch.latest_time                          = now
display.general.enablePreview                 = 1
display.general.timeRangePicker.show          = false
display.general.type                          = visualizations
display.statistics.rowNumbers                 = 0
display.statistics.wrap                       = 0
display.visualizations.charting.drilldown     = all
display.visualizations.singlevalue.underLabel = Recent EPD
display.visualizations.show                   = 1
display.visualizations.type                   = singlevalue
search                                        = | `licensing_epd` | stats sum(count) as count by _time | sort 0 -_time | head 2 | table count | transpose | rename "row 1" as current_count,"row 2" as historical_count | `get_delta` | fields delta,*

[Performance - Number Of Systems Not Reporting]
action.email.reportServerEnabled              = 0
alert.track                                   = 0
action.keyindicator                           = 1
action.keyindicator.title                     = Not Reporting
action.keyindicator.subtitle                  = System Count
action.keyindicator.value                     = current_count
action.keyindicator.threshold                 = 
action.keyindicator.delta                     = 
action.keyindicator.invert                    = false
dispatch.latest_time                          = now
display.general.enablePreview                 = 1
display.general.timeRangePicker.show          = false
display.general.type                          = visualizations
display.statistics.rowNumbers                 = 0
display.statistics.wrap                       = 0
display.visualizations.charting.drilldown     = all
display.visualizations.singlevalue.underLabel = Expected Hosts Not Reporting
display.visualizations.show                   = 1
display.visualizations.type                   = singlevalue
search                                        = | `host_eventcount(30,2)` | search is_expected=true | stats count as current_count


###### Lookup Generating Searches ######
## Audit - Events Per Day - Lookup Gen Breakdown
## 1  - Get event counts
## 1a - Using generic tstats
## 1b - Apply where clause exclusions
## 1c - Use subsearch to set _indextime "where" filter (earliest=-1d@d latest=@d)
## 1d - Split by index
## 2  - Set _time as -1d@d (this is the start date)
## 3  - Set key as _time|index for upsert
## 4  - upsert to licensing_epd
## Execute at 00:01 for the previous day
[Audit - Events Per Day - Lookup Gen]
action.email.sendresults = 0
cron_schedule            = 1 0 * * *
description              = Maintains a list of event counts per day per index
disabled                 = False
dispatch.latest_time     = +0s
enableSched              = 1
is_visible               = false
schedule_window          = 20
search                   = | tstats count where `event_count_filter` [| makeresults | `make_ts_value("-2d@d",start)` | `make_ts_value("-1d@d",index_start)` | `make_ts_value("@d",index_end)` | `make_ts_value("+1d@d",end)` | eval search="(_time>=".start." _time<=".end.") (_indextime>=".index_start." _indextime<=".index_end.")" | table search ] by index | `make_ts_value("-1d@d",_time)` | eval key=_time."|".index | outputlookup key_field=key licensing_epd | stats count


###### Report Searches ######
[Audit - Event Count Over Time By Top 10 Hosts]
action.email.reportServerEnabled                    = 0
alert.track                                         = 0
dispatch.earliest_time                              = -30d@d
dispatch.latest_time                                = now
dispatchAs                                          = user
display.general.enablePreview                       = 1
display.general.type                                = visualizations
display.statistics.rowNumbers                       = 0
display.statistics.wrap                             = 0
display.visualizations.charting.chart               = area
display.visualizations.charting.chart.nullValueMode = zero
display.visualizations.charting.drilldown           = all
display.visualizations.show                         = 1
display.visualizations.type                         = charting
search                                              = | `tstats` count where index=* [| metadata type=hosts | `lower(host)` | sort 10 - totalCount | fields host | format] by _time,host | timechart useother=`useother` count by host

[Audit - Hosts By Last Report Time]
action.email.reportServerEnabled     = 0
alert.track                          = 0
dispatch.latest_time                 = now
display.general.enablePreview        = 1
display.general.timeRangePicker.show = false
display.general.type                 = statistics
display.statistics.drilldown         = row
display.statistics.rowNumbers        = 0
display.statistics.wrap              = 0
display.visualizations.show          = 0
search                               = | `host_eventcount` | rename totalCount as count | `uitime(firstTime)` | `uitime(lastTime)` | table host is_expected firstTime lastTime count dayDiff

[Audit - Searches Over Time By Type]
action.email.reportServerEnabled                 = 0
alert.track                                      = 0
dispatch.earliest_time                           = -24h@h
dispatch.latest_time                             = now
dispatchAs                                       = user
display.general.enablePreview                    = 1
display.general.type                             = visualizations
display.statistics.rowNumbers                    = 0
display.statistics.wrap                          = 0
display.visualizations.charting.chart            = column
display.visualizations.charting.chart.stackMode  = stacked
display.visualizations.charting.drilldown        = all
display.visualizations.show                      = 1
display.visualizations.type                      = charting
search                                           = `search_activity` | timechart usenull=false count by search_type

[Audit - Searches Over Time By User]
action.email.reportServerEnabled                    = 0
alert.track                                         = 0
dispatch.earliest_time                              = -24h@h
dispatch.latest_time                                = now
dispatchAs                                          = user
display.general.enablePreview                       = 1
display.general.type                                = visualizations
display.statistics.rowNumbers                       = 0
display.statistics.wrap                             = 0
display.visualizations.charting.chart               = line
display.visualizations.charting.chart.nullValueMode = zero
display.visualizations.charting.drilldown           = all
display.visualizations.show                         = 1
display.visualizations.type                         = charting
search                                              = `search_activity` | timechart usenull=false count by user

[Audit - Splunkd Process Utilization]
action.email.reportServerEnabled     = 0
alert.track                          = 0
dispatch.earliest_time               = -24h@h
dispatch.latest_time                 = now
display.general.enablePreview        = 1
display.general.type                 = statistics
display.statistics.drilldown         = row
display.statistics.rowNumbers        = 0
display.statistics.wrap              = 0
display.visualizations.show          = 0
search                               = | tstats `summariesonly` avg(All_Application_State.Processes.cpu_load_percent) as avg_cpu_load,avg(All_Application_State.Processes.mem_used) as avg_mem_used from datamodel=Application_State.All_Application_State where nodename=All_Application_State.Processes All_Application_State.process=*splunkd* by All_Application_State.dest | `drop_dm_object_name("All_Application_State")` | eval "avg_cpu_load (%)"=floor(avg_cpu_load) | eval "avg_mem_used (MB)"=floor(avg_mem_used/1048576) | fields - avg_cpu_load,avg_mem_used | sort 100 - "avg_cpu_load (%)"

[Audit - Splunk Service Start Mode Anomalies]
action.email.reportServerEnabled     = 0
alert.track                          = 0
dispatch.earliest_time               = -24h@h
dispatch.latest_time                 = now
display.general.enablePreview        = 1
display.general.type                 = statistics
display.statistics.drilldown         = row
display.statistics.rowNumbers        = 0
display.statistics.wrap              = 0
display.visualizations.show          = 0
search                               = | tstats `summariesonly` max(_time) as _time,latest(All_Application_State.Services.start_mode) as start_mode,latest(All_Application_State.Services.status) as status from datamodel=Application_State.All_Application_State where nodename=All_Application_State.Services (All_Application_State.Services.service=splunkd OR All_Application_State.Services.service=splunk) by All_Application_State.dest | `drop_dm_object_name("All_Application_State")` | search start_mode!=auto | sort 100 + start_mode | fields _time,dest,start_mode,status

[Audit - Top Searches By Run Time]
action.email.reportServerEnabled = 0
alert.track                      = 0
dispatch.earliest_time           = -24h@h
dispatch.latest_time             = now
display.general.enablePreview    = 1
display.general.type             = statistics
display.statistics.drilldown     = row
display.statistics.rowNumbers    = 0
display.statistics.wrap          = 0
display.visualizations.show      = 0
search                           = `search_activity` | stats max(_time) as _time,min(total_run_time) as "min(run_time)",avg(total_run_time) as "avg(run_time)",max(total_run_time) as "max(run_time)",count by search_type,search,user | sort 500 - "avg(run_time)" | fields _time,search_type,"min(run_time)","avg(run_time)","max(run_time)",count,user,search

[Audit - Web Service Errors]
action.email.reportServerEnabled = 0
alert.track                      = 0
dispatch.earliest_time           = -24h@h
dispatch.latest_time             = now
display.events.fields            = ["source", "sourcetype", "host"]
display.events.list.wrap         = true
display.events.rowNumbers        = false
display.events.type              = list
display.general.enablePreview    = true
display.general.type             = events
search                           = | `datamodel("Splunk_Audit", "Web_Service_Errors")` | `drop_dm_object_name("Web_Service_Errors")` | head 1000

## Using configs/conf-indexes per SPL-103697
[Data Protection - Data Integrity Control By Index]
action.email.reportServerEnabled = 0
alert.track                      = 0
dispatch.latest_time             = now
display.general.enablePreview    = 1
display.general.type             = statistics
display.statistics.drilldown     = row
display.statistics.rowNumbers    = 0
display.statistics.wrap          = 0
display.visualizations.show      = 0
search                           = | rest splunk_server=* count=0 /services/configs/conf-indexes search="enableDataIntegrityControl=1" | stats values(splunk_server) as splunk_server by title,enableDataIntegrityControl | rename title as index | fields index,splunk_server,enableDataIntegrityControl

[Licensing - Events Per Day]
action.email.reportServerEnabled     = 0
alert.track                          = 0
dispatch.latest_time                 = now
display.general.enablePreview        = 1
display.general.timeRangePicker.show = false
display.general.type                 = statistics
display.statistics.drilldown         = row
display.statistics.rowNumbers        = 0
display.statistics.wrap              = 0
display.visualizations.show          = 0
search                               = | `licensing_epd` | stats sum(count) as count by _time | eval avg_eps=round(count/86400,1) | sort 0 -_time

[Licensing - Events Per Day Over Time]
action.email.reportServerEnabled          = 0
alert.track                               = 0
dispatch.latest_time                      = now
dispatchAs                                = user
display.general.enablePreview             = 1
display.general.timeRangePicker.show      = false
display.general.type                      = visualizations
display.statistics.rowNumbers             = 0
display.statistics.wrap                   = 0
display.visualizations.charting.chart     = column
display.visualizations.charting.drilldown = all
display.visualizations.show               = 1
display.visualizations.type               = charting
search                                    = | `licensing_epd` | timechart span=1d sum(count) as count

[Licensing - Events Per Index (Last Day)]
action.email.reportServerEnabled     = 0
alert.track                          = 0
dispatch.latest_time                 = now
display.general.enablePreview        = 1
display.general.timeRangePicker.show = false
display.general.type                 = statistics
display.statistics.drilldown         = row
display.statistics.rowNumbers        = 0
display.statistics.wrap              = 0
display.visualizations.show          = 0
search                               = | `licensing_epd` | eventstats max(_time) | where _time='max(_time)' | table _time,index,count | sort 0 - count
