
[add_datamodel_to_raw]
definition = `add_datamodel_to_raw("@@")`

[add_datamodel_to_raw(1)]
args       = prefix
definition = if(tag="authentication", "$prefix$datamodel=Authentication", "").if(tag="change", "$prefix$datamodel=Change_Analysis", "").if(tag="email", "$prefix$datamodel=Email", "").if(tag="ids" AND tag="attack", "$prefix$datamodel=Intrusion_Detection", "").if(tag="malware" AND tag="attack", "$prefix$datamodel=Malware", "").if(tag="network" AND tag="resolution" AND tag="dns", "$prefix$datamodel=Network_Resolution", "").if(tag="network" AND tag="session", "$prefix$datamodel=Network_Sessions", "").if(tag="network" AND tag="communicate", "$prefix$datamodel=Network_Traffic", "").if(tag="vulnerability" AND tag="report", "$prefix$datamodel=Vulnerabilities", "").if(tag="web", "$prefix$datamodel=Web", "")

[add_to_raw(1)]
args       = field
definition = `add_to_raw($field$,"@@")`

[add_to_raw(2)]
args       = field, prefix
definition = if(isnotnull('$field$'), "$prefix$$field$=".mvjoin('$field$',"$prefix$$field$="), "")

[add_subject_to_raw(1)]
args       = field
definition = `add_subject_to_raw($field$,"@@")`

[add_subject_to_raw(2)]
args       = field, prefix
definition = `add_to_raw($field$,"$prefix$")`.case(isnotnull('$field$_ip'),"$prefix$$field$_ip=".'$field$_ip',match('$field$',"^(\d{1,3}\.){3}\d{1,3}$"),"$prefix$$field$_ip=".'$field$',1=1,"").case(isnotnull('$field$_mac'),"$prefix$$field$_mac=".'$field$_mac',match('$field$',"^(([0-9A-Fa-f]{2}:){5}[0-9A-Fa-f]{2}|([0-9A-Fa-f]{2}-){5}[0-9A-Fa-f]{2}|([0-9A-Fa-f]{4}\.){2}[0-9A-Fa-f]{4})$"),"$prefix$$field$_mac=".'$field$',1=1,"").case(isnotnull('$field$_nt_host'),"$prefix$$field$_nt_host=".'$field$_nt_host',isnull('$field$'),"",match('$field$',"^(\d{1,3}\.){3}\d{1,3}$"),"",match('$field$',"^(([0-9A-Fa-f]{2}:){5}[0-9A-Fa-f]{2}|([0-9A-Fa-f]{2}-){5}[0-9A-Fa-f]{2}|([0-9A-Fa-f]{4}\.){2}[0-9A-Fa-f]{4})$"),"",'$field$' LIKE "%.%","",1=1,"$prefix$$field$_nt_host=".'$field$').case(isnotnull('$field$_dns'),"$prefix$$field$_dns=".'$field$_dns',isnull('$field$'),"",match('$field$',"^(\d{1,3}\.){3}\d{1,3}$"),"",match('$field$',"^(([0-9A-Fa-f]{2}:){5}[0-9A-Fa-f]{2}|([0-9A-Fa-f]{2}-){5}[0-9A-Fa-f]{2}|([0-9A-Fa-f]{4}\.){2}[0-9A-Fa-f]{4})$"),"",'$field$' LIKE "%.%","$prefix$$field$_dns=".'$field$',1=1,"")

[ueba_rtorder]
definition = rtorder

[ueba_cim_filter]
definition = where (tag="authentication") OR (tag="change") OR (tag="email") OR ((tag="ids" OR tag="malware") AND tag="attack") OR (tag="network" AND (tag="communicate" OR (tag="resolution" AND tag="dns") OR tag="session")) OR (tag="vulnerability" AND tag="report") OR (tag="web")

[ueba_cim_format]
definition = eval event_hash=sha1(_time._raw) | eval _raw=_time." ".host." indexer_guid=".replace(_bkt,".*~(.+)","\1").`add_to_raw(index)`.`add_to_raw(event_hash)`.`add_to_raw(source)`.`add_to_raw(sourcetype)`.`add_datamodel_to_raw`.`add_to_raw(action)`.`add_to_raw(additional_answer_count)`.`add_to_raw(answer_count)`.`add_to_raw(app)`.`add_to_raw(authority_answer_count)`.`add_to_raw(bytes_in)`.`add_to_raw(bytes_out)`.`add_to_raw(bugtraq)`.`add_to_raw(cached)`.`add_to_raw(category)`.`add_to_raw(cert)`.`add_to_raw(change_type)`.`add_to_raw(command)`.`add_to_raw(cookie)`.`add_to_raw(cve)`.`add_to_raw(cvss)`.`add_subject_to_raw(dest)`.`add_to_raw(dest_nt_domain)`.`add_to_raw(dest_port)`.`add_to_raw(dest_zone)`.`add_to_raw(duration)`.`add_subject_to_raw(dvc)`.`add_to_raw(file_hash)`.`add_to_raw(file_name)`.`add_to_raw(file_path)`.`add_to_raw(file_size)`.`add_to_raw(filter_action)`.`add_to_raw(http_content_type)`.`add_to_raw(http_method)`.`add_to_raw(http_referrer)`.`add_to_raw(http_user_agent)`.`add_to_raw(ids_type)`.`add_to_raw(internal_message_id)`.`add_to_raw(message_id)`.`add_to_raw(message_type)`.`add_to_raw(msft)`.`add_to_raw(mskb)`.`add_to_raw(object)`.`add_to_raw(object_attrs)`.`add_to_raw(object_category)`.`add_to_raw(object_path)`.`add_subject_to_raw(orig_dest)`.`add_to_raw(orig_recipient)`.`add_subject_to_raw(orig_src)`.`add_to_raw(product)`.`add_to_raw(query)`.`add_to_raw(query_count)`.`add_to_raw(query_type)`.`add_to_raw(record_type)`.`add_to_raw(recipient)`.`add_to_raw(recipient_count)`.`add_to_raw(reply_code)`.`add_to_raw(result)`.`add_to_raw(rule)`.`add_to_raw(severity)`.`add_to_raw(signature)`.`add_to_raw(signature_id)`.`add_to_raw(size)`.`add_subject_to_raw(src)`.`add_to_raw(src_nt_domain)`.`add_to_raw(src_port)`.`add_to_raw(src_user)`.`add_to_raw(src_zone)`.`add_to_raw(status)`.`add_to_raw(subject)`.`add_to_raw(tag)`.`add_to_raw(transport)`.`add_to_raw(ttl)`.`add_to_raw(url)`.`add_to_raw(user)`.`add_to_raw(vendor)`.`add_to_raw(xref)`
